tutorials/doubleCone/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (897 0 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (897 0 0 );
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (897 0 0);
    }

    top
    {
        type            zeroGradient;
    }

    wedge
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "side.*" 
    {
        type            wedge;//make wedge; google it
    }
}

// ************************************************************************* //
