tutorials/doubleCone/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 747;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 747;
    }

    outlet
    {
        type            waveTransmissive;
        gamma           1.4;
        psi             thermo:psi;
    }

    top
    {
        type            zeroGradient;
    }

    wedge
    {
        type            zeroGradient;
    }

    "side.*"
    {
        type            wedge;
    }
}

// ************************************************************************* //
