tutorials/doubleCone/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoLDFSSFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5e-2;

deltaT          1e-9;

writeControl    adjustableRunTime;

writeInterval   1e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1;

maxDeltaT       1e-06;

functions
{
//    #includeFunc MachNo
//    #includeFunc vorticity
}

OptimisationSwitches
{
      fileHandler collated;
      maxThreadFileBufferSize 2e9;
      maxMasterFileBufferSize 2e9;
}
// ************************************************************************* //
